macroregions = {
    "Захід": [
        "Львівська",
        "Івано-Франківська",
        "Закарпатська",
        "Тернопільська",
        "Волинська",
        "Рівненська",
        "Чернівецька"
    ],
    "Центр": [
        "Київська",
        "Житомирська",
        "Черкаська",
        "Полтавська",
        "Вінницька",
        "Кіровоградська",
        "Хмельницька"
    ],
    "Схід": [
        "Дніпропетровська",
        "Харківська",
        "Донецька",
        "Луганська"
    ],
    "Південь": [
        "Одеська",
        "Миколаївська",
        "Херсонська",
        "Запорізька"
    ]
}
